{"1": "PayPal, AmEx, Walmart – the digital payments alliances are taking shape", "2": "Facebook wins on BS points as TV interview with “very idealistic” Zuckerberg fails to land a blow", "3": "Is this the party to whom I am speaking? Digital identity meets blockchain", "4": "We’ll make work management as big as CRM says Asana co-founder", "5": "Small Robot Company plants seeds of Farming-as-a-Service via Tom, Dick and Harry", "6": "How TBM underpins agile at Mastercard and turns IT into an asset", "7": "Zuckerberg’s annus horribilis continues as Facebook growth slows", "8": "Global volatility demands modern, flexible IT for greater agility", "9": "Bed, Bath & Beyond’s omni-channel transformation needs more proof points as “detached from reality” management comes under fire", "10": "Memo to the US e-commerce market from ASOS – the British are coming!", "11": "What Marvin did next – omni-channel transformation at Lowe’s Stores", "12": "Bank of Montreal builds flexible harmony on Tibco", "13": "Sage Intacct CEO Rob Reid on the state on Intacct – AI should help the CFO transform", "14": "Does ERP, field service and asset management add up to operational IoT? An IFS analysis", "15": "Oracle OpenWorld 2018 – Ellison makes convincing pitch on automation and security for Oracle Cloud 2.0…but can’t resist trashing AWS", "16": "Things I found in 2008 – some are still holding up, others not so much", "17": "Urban Airship CEO on bringing brands to the palm of your hand", "18": "Facebook profits, revenues, users and advertisers all soar – what’s it going to take?", "19": "Could the new kingmakers turn us into puppets?", "20": "Don’t be evil. Avoid unintended consequences. Get the Ethical OS Toolkit.", "21": "Why Walmart went to India – International President Judith McKenna on the Flipkart gambit", "22": "GlaxoSmithKline shuts down Yammer, gets started on Workplace by Facebook", "23": "Retail’s pursuit of the Millennial Shopper – the exemplars keep on coming", "24": "OpenWorks 2019 – why Auto Europe moved their CMS database to open source, and what they’ve learned", "25": "Is the supply chain fit for purpose in a 21st century world? Lora Cecere thinks not.", "26": "The Goldilocks dilemma – the porridge challenge for US legislators in pursuit of ‘GDPR-US’", "27": "With the right technology, fast-growing companies can think big in 2019", "28": "Kohl’s looks to an Amazon returns boost this Holiday season", "29": "How to avoid the nightmare pitfalls of spreadsheet-based budgeting", "30": "Lloyds Banking Group and M&G Prudential share learnings on AI in financial services", "31": "Reagecon’s e-commerce experiment starts to yield promising results", "32": "Rumors of death and other exaggerations – updating Sears and HMV’s prospects", "33": "Enterprise hits and misses – Oracle OpenWorld blowout coverage as event season hits its final push", "34": "Bringing cloud services to the edge – Vapor is building a distributed AWS", "35": "OpenX exchanges broken Agile processes in bold 100-day reboot journey", "36": "Box on the future of enterprise content, workflow and intelligent search", "37": "Want to reduce friction and win at e-commerce? Build the right foundation", "38": "Rootstock takes away one more excuse not to move ERP to the cloud", "39": "H&M customers can now Click-and-Collect in 7 out of 47 markets – a ‘boast’ that illustrates the retailer’s omni-channel nightmare", "40": "FinancialForce and the quest to remake midmarket ERP for a digital world", "41": "Why do brands struggle with content-rich e-commerce experiences?", "42": "Bonmarché – still trying to delight the ‘original rebels’ and looking more to digital", "43": "Twitter, shadow banning and the war on social media", "44": "Workday’s Adaptive Insights implementation – Robynne Sisco CFO in the hot seat", "45": "Lessons learned on accessibility, inclusion and diversity at RedMonk’s Monki Gras – listen up and take action", "46": "RCI Bank aims to cash in on Big Data customer insights", "47": "Sensory deprivation – ‘garbage in, garbage out’ revisited for the IoT era", "48": "Altify – augmented intelligence can improve sales effectiveness", "49": "Oracle OpenWorld 2018 – Oracle and the World Bee Project create a buzz using smart hives to conserve declining bee populations", "50": "The passage to India for US e-commerce giants is set to get bumpier in 2019", "51": "Field service technicians need real-time access to expertise – and they won’t get it from enterprise software vendors", "52": "Macy’s shows signs of omni-channel life, but needs to sell the idea harder to sceptical Wall Street", "53": "Oracle OpenWorld 2018 – Our hopes and a sneak preview", "54": "Enterprise Hits and Misses (truncated) – Part II of the Jon’s on vacation edition", "55": "News analysis – how Liferay plans to build complete customer experiences with Triblio on board", "56": "Five expert tips on how to be a great hackathon host from AngelHack CEO (12)", "57": "How Nuance got microservices right – and built a modern apps platform with Couchbase", "58": "Want a better project? Get a better partner. How Cintas and SAP partner NIMBL are changing", "59": "Tech careers are earned on the job – Apple, IBM, and Google’s degree requirement change was long overdue", "60": "Adobe Summit 2019 analysis – CX hype is countered by Chegg’s digital turnaround story", "61": "Former Coca-Cola CIO reveals the recipe for AWS transformation", "62": "Data for Good – a question of relevancy", "63": "Nodding dogs, industry analysts, vendor hype and the future of workforce problem", "64": "International Women’s Day shines a spotlight on the need for greater gender parity", "65": "To be; to think; to know", "66": "McKinsey – the digital skills gap will get worse as cognitive automation intensifies", "67": "Oktane19 – Okta sets out its stall as an identity platform", "68": "Obama CTO Megan Smith lobbies for no-barrier tech recruitment to benefit all", "69": "Digital transformation, with empathy – a change management view", "70": "Six of the best – your top spankingly well-read stories from 2018", "71": "Dfinity and Stormj – examples of decentralized computing", "72": "ERP – is it all over? Hint – hello New Kingmakers", "73": "Become an ML-savvy organization – a practical AI review with Brian Dennett of Enable.AI", "74": "USA is in danger of squandering the AI race to China, House report warns", "75": "California passes nation’s first IoT security bill – too little too late?", "76": "Manufacturing a crisis? Upbeat data meets Trump’s tariffs", "77": "IBM fails GDPR sniff test – and loses an opportunity to educate on blockchain reality", "78": "Is CX the new killer app for ERP vendors? I seriously doubt it", "79": "Why SaaS is the best way to monitor on-premise environments", "80": "How data analytics is assisting with the fight against malaria", "81": "What would it help to start seeing?", "82": "Does Debenhams have time to escape the retail apocalypse with digital drive?", "83": "Enterprise hits and misses – AI needs upskilling, and Apple needs the services economy", "84": "Ocado retail tech platform deals are increasing, but remain short on detail", "85": "Enterprise hits and misses – Sears goes on layaway and chatbots file lawsuits", "86": "World Economic Forum – robots will take jobs, but upskilling will put humans ahead…if we do it properly", "87": "How JDA Software sees the ‘ubiquitous retail’ blue yonder", "88": "ThyssenKrupp Elevators gets a lift from digitalisation with Microsoft Azure", "89": "Is targeting B2B buyers on social channels effective? Readers debate", "90": "Criticism of Salesforce’s border protection deal highlights the million dollar question around corporate activism", "91": "FinancialForce CEO on the value of PSA as a revenue generator", "92": "US military to tech protestors – ‘We’re at war; pick a side’", "93": "Blockchain app for miners in Rwanda ensures the minerals in your iPhone are conflict-free", "94": "Retail transformation roundup – insights from the latest retail projects and earnings news", "95": "‘GDPR-California’ is a victory, but not the endgame of ‘GDPR-US’ – the fight goes on", "96": "AI, edge and security share top billing at Microsoft Ignite", "97": "Why third party digital delivery isn’t on everyone’s menu in the restaurant business", "98": "EU digital tax plans are off the table, but national efforts are still on a collision course with Trump", "99": "How AWS is helping River Island to avoid the same fate as other retailers", "100": "How Pulse is crowdsourcing the wisdom of the CIO", "101": "Splunk jumps into BizOps to make some sense of the chaos", "102": "Speed as a competitive edge – how Fabuwood Cabinetry uses modern ERP as a data platform", "103": "AI + Analytics = the intelligence we need for business", "104": "ASOS suffers from GDPR indigestion with U.S. sales tax issues still to swallow", "105": "SuccessConnect 2018 – well-being at work isn’t fluffy; it’s the future we should be pushing for", "106": "Macy’s – another year, another restructuring, but there are omni-channel retail successes", "107": "Google gets whacked with €50 million GDPR compliance fine but what if we could monetize our data?", "108": "The rise of the prediction machines and a skills ontology – Workday Rising 2018", "109": "Royal Bank of Scotland issues first dividend as digital investments take hold", "110": "8 ways to wake up from the digital nightmare and succeed", "111": "Quarks to Quorn, physics to fizzy drinks – looking into the retail Blue Yonder with Michael Feindt", "112": "Mastercard going digital? Table stakes. Finding new markets? Priceless", "113": "Dreamforce 2018 – Ashfield Healthcare roles out Salesforce Health Cloud globally", "114": "The EU’s Right To Be Forgotten should stay within the EU – an important legal opinion in a Fake News world", "115": "New data demonstrates generally superb cloud connectivity, but quirks remain", "116": "Exploding sneakers are only one reason for passing IoT cyber-security regulations", "117": "Trust and pricing in ERP for SMBs – a conversation with Sunil Pande, CEO VersAccounts", "118": "Google bails on US defense project, cites ethical concerns", "119": "Travelers Insurance speeds up business ask to production process with MongoDB", "120": "Putting the new Jenkins to work at HSBC", "121": "Dreamforce 2018 – explaining MuleSoft’s application network graph", "122": "Tech powers The Bike Project’s work in helping refugees navigate new lives", "123": "Enterprise hits and misses – CIOs take the digital plunge, but digital transformation needs buy-in", "124": "‘Call for Pricing’ is trending in SaaS – and that’s not good", "125": "Thinking about thinking", "126": "Strava leaves AWS Redshift in the dirt in its race to Snowflake", "127": "Enterprise hits and misses – Mobile World Congress pushes 5G, workers go rogue on their messaging apps", "128": ".DS_Store", "129": "Bank of America CEO – digital-only is not the way to go in banking", "130": "Enterprise hits and misses – surviving tech projects and debating enterprise blockchains", "131": "Asana promises to rescue marketing and creative types from email chaos", "132": "The robotic future of work is messy, fuzzy and uneven", "133": "EU-Japan free trade deal paves way for global data governance drive in ‘Society 5.0’", "134": "Infor CEO Charles Phillips on the $1.5bn that sets up a massive tech IPO", "135": "Lowe’s and Home Depot – home improvement retailers in search of digital fixing up", "136": "Cloud ERP isn’t a handshake deal – it’s a value extraction challenge. Here are the stages.", "137": "HSBC aims for mobile-centric banking", "138": "Accessibility matters, but so does culture change – lessons from diginomica’s workplace diversity coverage", "139": "GAP CEO sees his retail assets as digital, data and real-world stores", "140": "Weekend musing – is Nike a corporate activist?", "141": "What has the attention of marketers for 2019?", "142": "Censorship or fair play? European Parliament takes step closer to controversial copyright regime, but will Big Tech fight back?", "143": "Dreamforce 2018 – where are all the men?", "144": "India’s passage to data protection has a big local bump in the road", "145": " AO.com looks to AWS for brighter approach to Black Friday preparations", "146": "‘Financials first’ conversations rising as Workday aspires to $10 billion run rate", "147": "Dreamforce 2018 – why AI isn’t yet smart enough to deal with Wendy’s customers", "148": "Salesforce packages up IoT for a better field service experience", "149": "7 work management best practices for the enterprise", "150": "Exclusive – how Innovative Composite Engineering excels at manufacturing quality and security with IQMS", "151": "Nicholas Carr was right – IT died, but was resurrected", "152": "Five questions I’m chasing about retail’s digital winners and losers – a Shop.org preview", "153": "Unilever is using Google Cloud to help it create 1 billion one-to-one relationships with its consumers", "154": "SAP’s restructuring – Hunger Games, Game of Thrones or both?", "155": "SIG fills up with food for thought from GE Digital", "156": "How Bloomberg uses machine learning to create a competitive advantage", "157": "Facing up to the need for regulation – Microsoft recognises Big Brother potential", "158": "5 hidden costs to consider before you move to SaaS ERP", "159": "How to squander an enterprise media relations day", "160": "Will vendor rankings replace magic quadrants? HfS Research thinks so", "161": "The power of a developer community – you can’t succeed in cloud ERP without one", "162": "Inforum 2018 – Flint Hills Resources shares how to pull off a rapid CloudSuite Financials implementation", "163": "How IQMS customer Custom Profile makes manufacturing modern by bridging the IT – business gap", "164": "‘GDPR-US’ – the lobbying gets underway with financial penalties conspicuously absent", "165": "How to energize your Field Service Workforce Management – a 3 step program", "166": "We need a new conversation about the world we’re (not) building", "167": "SAP TechEd 2018 Barcelona – Björn  Goerke, SAP’s CTO – There is no future with ABAP alone, and there is no future in SAP without ABAP.", "168": "Coupa enlists Barclaycard to speed and streamline supplier payments", "169": "Leadership, transformation, cricket and dogs with Vijay Vijayasankar", "170": "digibyte: How not to do predictions for 2019 or any other time", "171": "AI and digital must put people back at the center of work – Unleash19", "172": "Why China gains most from the Fourth Industrial Revolution – according to PwC", "173": "DevOps – all about culture change, not tech adoption", "174": "Are digital marketplaces the future of retail?", "175": "Will robotic news production help or hinder?", "176": "At the dawn of a new generation of enterprise applications", "177": "Say hello to Marty the Robot. He’s here for your retail job.", "178": "The Year That Was – the Dennis version", "179": "Massive losses, growing tech spend and an M&S elephant in the room, but Ocado CEO says this is “our time”", "180": "Lowe’s CIO hits the nail on the head with $550 million DIY project – that’s Do-IT-Yourself", "181": "It’s not enough to think outside your box", "182": "Remaking ADP – a review of progress and direction", "183": "EU backs Berners-Lee over Paul McCartney as copyright directive is voted down", "184": "Slack co-founder Cal Henderson on the 1% emoji and values at work", "185": "Workday Rising Vienna 2018 – a retrospective focus on diversity and analytics", "186": "SuiteWorld19 – NetSuite opens up its Brainyard to share the knowledge", "187": "Communities are a-coming and you’d better be ready for them", "188": "For growth, scalability, innovation – it has to be true cloud", "189": "Are labor unions and collective bargaining coming to Big Tech?", "190": "We have a holiday season stocking stuffer for engaged diginomica readers – Disqus", "191": "How Workato combines headless workflow with serverless integration", "192": "The US insurance industry needs rebooting – here’s why", "193": "The state of Tableau 2018 – CPO Ajenstat on Tableau as a data platform, and the push for analytics ubiquity", "194": "Express needs to deliver more speed around omni-channel transformation", "195": "Cloud service adoption is not a cost-cutting exercise", "196": "AstraZeneca reveals the data engine behind their cloudy business transformation – a Talend use case", "197": "The Fifth Industrial Revolution is coming – and it’s about trust, values and saving the planet", "198": "Kimble CEO on the challenges ahead for professional services", "199": "Is it too late to save Facebook? Setting the stage.", "200": "NRF to retailers, and Wall Street – we need better metrics to assess retail health", "201": "Retailers are not in the software upgrade business – Oracle weighs in on 2019 retail trends, from AI to cloud adoption", "202": "Adobe report analysis – email is still #1, but a cross-channel strategy is more important than ever", "203": "The new, new NetSuite – it’s all about your growth at SuiteConnect", "204": "Protecting yourself from the ‘things’ on your home network", "205": "Apttus ambition undimmed as new owners pick up CEO search", "206": "ServiceNow becomes a “strategic platform” for National Grid as it expands across the business", "207": "Quality beats quantity at Twitter as it cleans house. Pity the market doesn’t get it", "208": "Dreamforce 2018 – The Container Store competes with Amazon on service, not footprint", "209": "The 2019 enterprise software un-predictions", "210": "Nudge, plead or beg? How do you really influence behavior change?", "211": "Looking for better recruitment? We went to Specsavers", "212": "Enterprise hits and misses – techlash at Davos with the digital skills gap in focus", "213": "Dreamforce 2018 – how to succeed with customer success", "214": "Cloud Next 18 – How Google sees the future of AI in the enterprise", "215": "The US escalates its war of words with India and China over digital trade barriers", "216": "VMworld Europe – VMware wants to give every user the ‘easy button’ to press", "217": "5G represents the rise of open infrastructure", "218": "How are retailers winning? Stats and reflections from Shop.org", "219": "Tackling the corporate data literacy shortfall in 2019", "220": "ICON CIO – telemedicine, wearables and AI could boost clinical-trial participation", "221": "Can Oracle realize its ambition to compete as a hyperscale cloud?", "222": "Pin-board wizards at TCC Wireless tilt to ThoughtSpot for data analytics", "223": "Addison Lee Group CIO – focus on experience, not buzzwords", "224": "Enterprise hits and misses – blockchain gets explained, Abobe – Marketo gets analyzed, and event season rolls on", "225": "How to keep edge computing open for business –  let the gorillas write the script", "226": "Cloud technology – increasingly unimportant in important ways", "227": "Oracle OpenWorld 2018 – Noble Plastics uses IoT to keep a close eye on plant-floor assets", "228": "How a frictionless world changes the rules for growing a business", "229": "An early assessment of the Ultimate acquisition", "230": "Bringing industrial analytics to bear on real world problems – a Baker Tilly example with Plex", "231": "Four retailers and reality – a progress report on fashionable omni-channel transformation", "232": "As ad spend moves to digital is it enough to drive digital transformation in CX?", "233": "Change as a discipline – how Accumold excels at data-driven manufacturing with IQMS", "234": "Carrot or stick – how best to tame the social media beasts?", "235": "Is SAP’s ABAP a special snowflake or has a Git run it over?", "236": "Enterprise hits and misses – retailers get a personalization grade, and big data gets a rethink", "237": "Dreamforce 2018 – What do digital governments need? Rebels that can rebuild trust", "238": "Enterprise hits and misses – IBM gets Red Hat, the tech media goes trick or treating", "239": "Nutanix launches itself at the edge…if you are ready to go along for the ride", "240": "Embracing the power of the AI co-worker", "241": "Putting Adobe’s partnership strategy to the test – Workfront’s view from the Adobe Summit", "242": "Look past the AI hype and into the data – Qlik on winning in retail", "243": "Has GDPR changed marketing?", "244": "Dreamforce 2018 – it’s all about integration, says Salesforce product chief Bret Taylor", "245": "How to get more out of the IT budget – learnings from Amadeus and JLT", "246": "Software will never be beautiful – it’s the experience that counts", "247": "The failure of Twitter and social media management suites to get GDPR", "248": "Einstein Voice will get Salesforce users talking", "249": "How Microsoft plans to save the internet from bad actors with AccountGuard", "250": "Transformation in retail is no luxury", "251": "Enterprise hits and misses – talking IoT and blockchain futures, while data privacy is bought and sold", "252": "The world can’t afford cheap data", "253": "Blue Prism shows its colours  around the rise of the ‘Digital Worker’", "254": "Digital ambitions deliver healthy returns for Weight Watchers – new San Francisco office planned", "255": "Facebook’s 2018 crises mean it’s time to unfollow its ‘sorry’ CEO", "256": "How Nutanix uses Clari for AI-powered sales and forecasting – with 99 percent adoption", "257": "Salesforce puts its money where its mouth is with $1 million pledge for families separated at the U.S. border", "258": "AirAsia lands on Google Cloud to build a frictionless digital travel business", "259": "The boy stood on the burning deck – M&S troubles go on", "260": "Enterprise hits and misses – making sense of the Chinese server sabotage allegations, as silly season rolls on", "261": "The CIO at Del Monte Foods, he says yes to IT cost savings from cloud migration", "262": "How Talend mobilizes the data behind Domino’s digital deliveries", "263": "Why you should take notice of the open source in enterprise suckers conundrum", "264": "How hard is it to solve the ethics in AI problem?", "265": "How Milk Makeup is making its mark on e-commerce – a Salesforce use case", "266": "CF Industries on their move to S4HANA Cloud – “We’re not cloud-first; we’re business-first”", "267": "MBX 2019 analysis – Oracle updates its AI strategy for B2B, including the impact of DataFox", "268": "Conversational selling keeps B Squared Media on a growth track", "269": "Coupa stacks up new customers as subscription revenue growth hits 42%", "270": "The truth is that AI can make us better at being human", "271": "MariaDB CEO on the open source enterprise – we can bridge the gap between bare metal and microservices", "272": "Aspen Pumps SAP ByDesign lessons from multi-geography implementations", "273": "NRF 2019 – All retailers are in the data business now; Chick-fil-A shows why.", "274": "Building on the SAP Cloud Platform – SuccessFactors partner EIR shows how its done with compensation analytics", "275": "From customer support to customer experience, are we ready?", "276": "Foyles war against Amazon’s “siren call” bolstered by Waterstones in omni-channel book store sector", "277": "Salesforce adds low-code tools so everyone can automate their CRM workflow", "278": "SuiteWorld19 – PetShop delivers pet food as a service for your pedigree chum", "279": "Oracle OpenWorld 2018 – Park Hotels and Resorts makes the cloud its destination of choice", "280": "Adobe Summit 2019 – how Avianca Airlines is facing the transformation challenge", "281": "The shift from science projects to business processes – NVIDIA GTC shows the pulse of AI", "282": "Old Navy widens the gap between its omni-channel future and The GAP’s legacy retail present", "283": "Retail buzzword bingo at Williams-Sonoma sets the digital transformation agenda", "284": "AWS fully embraces hybrid cloud, ARM and custom silicon at re:Invent 2018", "285": "Sales and marketing working in tandem – organizational Holy Grail or the new reality?", "286": "Build better mobile experiences – testing with Apptimize", "287": "Tech investors and the ‘Weinstein Clause’ – avoiding tomorrow’s #MeToo moments", "288": "Nike just does it with digital re-invention", "289": "Stock shock and fixing the roof", "290": "SuiteWorld19 – Williams Sonoma cooks up a better way to manage 10 global sites", "291": "Dreamforce 2018 – Governor of Colorado gives rousing speech on using tech to build trust with citizens", "292": "Making APIs the bedrock of IoT development", "293": "Welcoming Host Analytics to the diginomica family", "294": "The New York Times – far from ‘failing’ as a Subscription Economy exemplar", "295": "Oracle disappoints for Q1 as revenue growth slows", "296": "Can you trust the seasonal earnings release?", "297": "Four very likeable things in SYSPRO 8", "298": "Lipari Foods delivers answer to supply chain challenges with WebFocus", "299": "Securing trust and identity in IoT with open source – a conversation with Ockam co-founders", "300": "Alexa, can you give me a daily enterprise tech Flash Briefing? “Not exactly, but you may like these podcasts.”", "301": "Exclusive – how JAAS Systems built a manufacturing vertical on Acumatica’s cloud ERP platform", "302": "Salesforce’s co-CEOs turn in strong Q2 ahead of Dreamforce", "303": "Deloitte survey on strategic risk management offers important recommendations", "304": "How Google Cloud aims to stay relevant as AWS momentum plows on", "305": "Five useful things to know if you’re going to a hackathon (22)", "306": "Don’t fall off the edge – why IoT still needs the cloud", "307": "Will 2019 be the year of GDPR-US? Don’t count on it, but…", "308": "Target aims for a Happy Holidays with digital fulfilment to the fore", "309": "Apttus IPO dream ends in private equity buyout by Thoma Bravo", "310": "Dreamforce 2018 – Salesforce shopper data revealed", "311": "Burgers, toothbrushes and flatpack furniture – Zuora CEO points to Subscription Economy transformation boom", "312": "Why 2019 needs to be the year we slow down with data – a CDO perspective", "313": "Intel is not ceding the AI chip market to NVIDIA – takes on GPUs with a multi-faceted strategy", "314": "Cloud ERP taking off but confusion persists around security and control topics", "315": "How United Way Worldwide took collaboration viral with Workplace by Facebook", "316": "Enterprise hits and misses – recruiting tech needs a fix, vendor contract negotiations need transparency", "317": "A funny thing happened on the way to cloud world domination – VMware in focus", "318": "Is it too late to fix Facebook? Part Deux – 4 ideas that might (or might not) work", "319": "Excel is a snapshot of the past. BI helps you see the future", "320": "Thomas Otter on owning your HR tech strategy – are you a sunflower or a daisy?", "321": "What a difference three years in service management makes", "322": "Weekend Musing – deconstructing HfS 2019 predictions", "323": "Overcoming the AI, ML and data science skills gap – hashing it out with Vijay Vijayasankar of IBM", "324": "Making sense of digital transformation – breaking innovation down to five essential senses", "325": "Taming the internet – ‘something must be done’, but is the UK’s plan really the something we need?", "326": "Parkinson’s UK takes battle for a cure to the cloud with Snowflake Computing", "327": "Unicorn startups, tigers, and leopards – they’re all-in on cloud apps", "328": "Zoho CEO – Amazon is coming to enterprise software", "329": "Jim Snabe, Chairman of Siemens, expands on Dreams and Details", "330": "CEO confidence and digital investment fuels strong Q3 for Salesforce", "331": "Enterprise hits and misses – Amazon re:Invents (without Oracle), cloud HR faces transformation", "332": "Oracle OpenWorld 2018 – American Red Cross equips volunteers with mobile app for disaster relief", "333": "Zoholics 2019 review – Zoho One customer Purolite shares lessons on cloud adoption and adapting to change", "334": "L’Oréal’s Augmented Reality alliance with Facebook adds to the digital makeover", "335": "Data is the topping for burger firm Five Guys JV’s Euro-expansion", "336": "How to make sure your customer panel is boring and forgettable again this year", "337": "Brian Sommer’s Month in Brief – February 2019", "338": "Welcome to Sage Intacct", "339": "It’s not just Facebook that has an ethnicity problem", "340": "5 proven benefits of real-time analytics for professional services organizations", "341": "Under the hood of Adobe Sensei – how Adobe is evolving their analytics with AI", "342": "Welcome to Workfront, a pioneer in enterprise work management", "343": "How Automated Insights uses Natural Language Generation to boost our grasp of data – in Tableau and beyond", "344": "Oracle v Rimini Street – the saga continues with this round going to Oracle", "345": "Microsoft checks out a push into Shopify’s retail e-commerce space", "346": "The Year That Was – the Jessica version", "347": "Growing up is child’s play for edtech start-up SAM Labs", "348": "The Blockchain Paradox – or why we can’t agree on anything", "349": "Cloud adoption builds essential agility into SBAB’s banking model", "350": "TibcoNow – building an edge innovation playground", "351": "Slow digital transformation makes it hard to see beyond Bed, Bath and Beyond’s troubles", "352": "Hire for skills, not degrees – a new paradigm to tackle disenfranchisement in the digital economy", "353": "Workday Q2 FY2019 impresses, warns of headwinds associated with Adaptive Insights acquisition", "354": "Vendors aren’t helping us to build agile HR, says Deutsche Telekom exec", "355": "JC Penney CEO – we need to re-establish “the foundations of retail” despite years of digital transformation", "356": "The quiet bottoms up wirearchical ‘revolution’ and why it matters", "357": "Parliament, pressure and panic – how the UK Government got hold of Facebook’s confidential documents", "358": "150-year-old candy maker shares its 3-part recipe for maintaining quality", "359": "Microsoft soups up Dynamics 365 with AI and HoloLens add-ons", "360": "Everyone wants more of the digital pie, but what will it take to provide a bigger slice for all?", "361": "Lloyds Banking Group – a £3 billion digital transformation progress report", "362": "How Toys R Us’s collapse has focused Hasbro’s digital thinking", "363": "Salesforce sets target of $28 billion revenue by 2023 as economic confidence holds", "364": "Dreamforce 2018 – adidas gets closer to customers by adopting an athletic mindset in business", "365": "Daimler drives new HR insights with graph database technology", "366": "Dreamforce 2018 – rethink how to budget for Salesforce, says Bluewolf", "367": "Weekend musing – what a small local butcher can teach the enterprise about CX", "368": "Is AI an asset to hiring, or will it bring us down a sinkhole of algorithmic bias?", "369": "How Graph offered a Eureka! moment for a UK SMB", "370": "HoloLens 2 debuts at MWC, but don’t mention the war! – more ethical activism from tech employees", "371": "FedEx ramps up e-commerce offerings as its Renewal IT upgrade gets a delivery date", "372": "Bean counting isn’t enough – Vena on the CFO as chief data storyteller", "373": "Reduce online threats for SMBs by 85% – big claim from Global Cyber Alliance", "374": "China Conundrum Bombshell – U.S. files 23 criminal indictments against Huawei in two Federal courts", "375": "FocusConnect 2018 – a sit down with the CEO", "376": "Women in tech – be offended, be visible and stop feeling guilty!", "377": "Exclusive – IQMS’ CEO on why IQMS was acquired by Dassault Systèmes – and what’s next", "378": "What is driving native advertising growth, and how can brands do it the right way?", "379": "Dreamforce 2018 – PwC gamifies Salesforce to drive adoption and usage", "380": "Does your software vendor reduce your business risk?", "381": "Couchbase CEO Matt Cain – IT must innovate even when budgets are flat", "382": "Celtic Manor mixes VMware and Dell to brew a template for its future", "383": "Face off? Microsoft and regulation", "384": "Re-skilling and up-skilling for the AI age – an organizational challenge demanding radical change", "385": "NetHope CEO – profitable advice on bridging the non-profit digital skills gap in 2019", "386": "Integrators who don’t ‘integrate’ and other ERP problems", "387": "Accenture after Pierre – business as usual, with no pause button", "388": "Hugo Boss boss sees digital fashion design on trend as online sales top €100 million", "389": "Tackling the techlash – it’s time to “recover the soil” in the digital economy", "390": "Nine lessons from Accuride’s 2-tier ERP with Plex, Workday and SAP", "391": "APM vendor New Relic has Q1 growth spurt as enterprise push continues", "392": "Enterprise hits and misses – big data falls, blockchain rises, and security trusts no one", "393": "Williams Sonoma vs Amazon – a court case that has wider implications for retail e-commerce", "394": "Practical AI – a wearables use case from blind photographer David Katz", "395": "Yes, quality audits can help manufacturers stay customer-driven – and even change sales and marketing", "396": "Mobile World Congress – 5G, the business agenda and Trump’s China syndrome", "397": "Manufacturing quality that’s out of this world – insights from robotics on Mars", "398": "An SAP Business ByDesign consultant shares how the partner ecosystem is making it hard for cloud ERP", "399": "The Month in Brief – October 2018 (it was a busy month!)", "400": "Robot rights – a legal necessity or ethical absurdity?", "401": "Coupa CEO Bernshteyn – our customers can “weather the storm” of economic change", "402": "Intel starts talking real 5G data center use cases", "403": "Enterprise hits and misses – blockchain is a paradox; AI is a customer service automater", "404": "The China Conundrum – are we headed for a supply chain meltdown?", "405": "Coupa builds out functional capabilities with DCR Workforce buy", "406": "Don’t be fooled into thinking Google Cloud wants to compete on infrastructure alone", "407": "Ab fab – Edwards turns to Hadoop in push for smarter semiconductor factories", "408": "“That may be good for the world, but it’s not good for us” –  Zuckerberg, Facebook and your data", "409": "ASOS and Ocado – why warehouses matter in an e-commerce retail world", "410": "Brian’s The Month in Brief", "411": "Oracle OpenWorld 2018 – the cloud security story", "412": "A million European lawyers say re-do Privacy Shield and slam the Eurocratic blind eye", "413": "The ‘Father of the Web’ wants a new contract to redeem his troubled child", "414": "Why Texas Scenic Company is pursuing construction in the cloud with Acumatica ERP", "415": "McKinsey warns that AI will further divide the world economy into winners and losers", "416": "How Bosch broke free from silos to reorganize as agile teams", "417": "Microsoft’s Future Decoded – it’s all about AI and ethics", "418": "Zuckerberg vs the Serjeant-at-Arms – no contest as Facebook documents are seized by UK Government", "419": "Built on AWS, Zendesk Sunshine is a new take on enterprise SaaS and CRM", "420": "Is it possible to contain the security risks of Huawei equipment? The UK NCSC thinks so, but should you?", "421": "How to avoid lengthy SAP detours on your digital transformation roadmap", "422": "Frank Holland, new Apttus CEO, on a mission to drive growth", "423": "Blockchain and marketing – disruption in the works?", "424": "How Guardian Life’s shift to AWS enabled it to go agile, cut costs and partner with insuretech start-ups", "425": "Teradata v. SAP – what it means to customers and prospects", "426": "New York pauses ride hailing expansion – the gig economy glow fading?", "427": "Americans trust the military more than Big Tech to develop AI", "428": "The fifth-gen net is much more than “fourth+1”", "429": "SuiteWorld19 – Oracle CEO Mark Hurd on moving NetSuite to the Oracle Cloud", "430": "Nutanix and HPE partner to open up the hybrid cloud PaaS market – what to expect", "431": "How American Airlines is using HR as a driver for change – a SuccessConnect 2018 use case", "432": "Design thinking – a practitioner’s practical perspective", "433": "Book review – Dreams and Details, Jim Snabe’s insights into SAP’s business transformation", "434": "Avon’s still calling, but shifting to online channels is taking time", "435": "Will 2019 be the year when the US finally gets serious about data protection?", "436": "Digital and delivery – McDonald’s growth accelerators that are paying off", "437": "SAP TechEd 2018 Barcelona – turning the corner, aligning business with IT", "438": "Cloud Next 18 – Google puts Kubernetes on-premise and TPUs on the edge", "439": "Why you should invert your business model – and how to do it", "440": "Enterprise hits and misses – KFC and Pizza Hut cook the omni-channel, while we debate the enterprise user experience", "441": "Debating the business of private information", "442": "No deal, no Netflix? There’s much worse than that for the digital economy in latest Brexit notices", "443": "Women in tech – it’s not about being Wonder Woman!", "444": "“80% NASA, but 20% Disney too” – how digital transformation should happen", "445": "Plex Systems appoints new CEO Bill Berutti – here’s a first look at his plans", "446": "Huawei Connect 2018 – the smart police are coming", "447": "How the Bank of England second-guesses hackers with Splunk", "448": "Walmart as “innovation company” – the CEO perspective on retail digital transformation", "449": "The future of parts – from calculated hunch to intelligent prediction", "450": "DataSelf on BI adoption – to move beyond the data geeks, we have to solve human problems.", "451": "How do we build a next generation digital marketing strategy?", "452": "No pain, no gain at Vivobarefoot", "453": "Dreamforce 2018 – KLM customer service takes off with AI", "454": "Google advances Istio – this could be bigger than Kubernetes and serverless", "455": "H&M needs digital meatballs on the menu, but struggles with the recipe", "456": "Enterprise hits and misses – Thanksgiving can’t save us from AIOps", "457": "How Adore Me stepped off the BI rollercoaster and brought self-service analytics to business users", "458": "Levelling the gig economy playing field – the Worksome perspective", "459": "How Zendesk pursues frictionless collaboration with Zoom video conferencing", "460": "Containers and serverless functions – a modern architecture needs both and more", "461": "Twilio proclaims a communications renaissance for frictionless enterprise", "462": "How Big Tech plans to pre-empt California’s tough Consumer Privacy Act", "463": "Technology for social good – stopping the poachers and saving the planet with AI, drones and sensors", "464": "Vera Bradley gets a handle on customer texts with Nice InContact", "465": "The luxury IPO that could take the high end retail e-commerce story to the next stage", "466": "SuccessFactors consultants in the Wild West implementation dock", "467": "Innovation – it’s in our genes, and nurtured by networks", "468": "TrustRadius challenges software vendors to be more transparent in sales and marketing – but how?", "469": "OpenText CEO opens up on organic growth ambitions", "470": "Enterprise hits and misses – AI bias is political, and digital is impactful", "471": "Enterprise hits and misses – IT dies and is resurrected, while personalization tries to scale", "472": "Hudson’s Bay – claiming retail uniqueness, but still struggling with omni-channel 101", "473": "DevOps on a mainframe? Surely not?", "474": "Why your data should be priority one as you build your cloud computing plan", "475": "Autonomous Database trials pick up speed, but Oracle’s cloud transition is still too slow for Wall Street", "476": "How to put data storage on autopilot –  use software abstraction layers and ML augmented data analytics", "477": "Customers are the gems in Oracle’s second-quarter earnings beat", "478": "2018 – the year ‘Big Tech’ lost its innocence", "479": "Why customer experience is so elusive, and AI is even trickier – a chat with the implausible Esteban Kolsky", "480": "How Heroku built its self-service analytics future on the Looker platform", "481": "Hertz appoints new CIO as it nears completion of ‘end-to-end technology upgrade’", "482": "EU to the US – you’re in the wrong camp when it comes to data regulation and time’s running out", "483": "Octopus Energy gets its tentacles around M&S with smart digital strategy", "484": "The Marketing Cloud wars re-ignite as Adobe snaps up Marketo for $4.75bn", "485": "Dreamforce 2018 – “Hey Siri, how do we improve the mobile developer experience?”", "486": "Dreamforce 2018 – it pays to check your Salesforce licence usage as Ulster Bank found out", "487": "Fake research results and reality – let’s talk blockchain black eyes", "488": "Dropbox buys HelloSign – a lucrative and strategic move", "489": "Survey says that marketers are excited about the potential of AI – but where does it have impact?", "490": "L’Oréal’s CX – baking in the supply chain elements", "491": "Gated offers – a different approach to personalization that gives consumers control", "492": "Tibco aims to contextualise metadata as the multi-cloud ‘connective tissue’", "493": "Global Emancipation Network tackles human trafficking crisis with Splunk", "494": "The Year That Was – the Barb version", "495": "If you fix just one process in HR, make it recruiting – Part 1 the dumb ATS", "496": "IBM Watson rolls out pre-trained AI software for IoT connected manufacturing", "497": "AI, meet accessibility – new potential for upping skilled employment", "498": "episerver’s intelligent rise as it gears  up for more growth", "499": "How to break free of data silos for a truly intelligence-driven supply chain", "500": "Facts at the intersection between renewable energy, IoT and blockchain – my conversation with Tom Raftery", "501": "Zoho boosts AI, analytics to unify sales and customer service", "502": "SAP shows healthy Q2 FY 2018 cloud revs, ups outlook – a call with Luka Mucic, CFO", "503": "Turning on the tap on digital transformation in the utilities sector", "504": "Time to view customers through a 360° lens", "505": "5 ways ASC 606 changes how services companies book revenues", "506": "The Year That Was – the Jon version", "507": "The Year That Was – the Stuart version", "508": "How to integrate your way to digital transformation success", "509": "Why do we need a new analytics platform? Looker’s CEO shares six keys to modern analytics", "510": "A den of thieves – LinkedIn’s copyright infringement handling is abysmal", "511": "Enterprise hits and misses – HR takes on AI, and machine learning raises the enterprise security stakes", "512": "Salesforce aims to bypass expensive mobile app dev", "513": "AWS broadens machine learning portfolio at re:Invent with services for both novices and experts", "514": "digibyte – another 11th hour reprieve for Sears", "515": "Looking for growth in 2019? How to stay agile and get ahead", "516": "Future of Oracle Cloud could and should be SaaS rather than IaaS", "517": "Reading material update – a world where ‘systems of reference’ matter", "518": "CommLive18 – How JLL uses FinancialForce as a growth driver", "519": "Bed, Bath & Beyond needs to get beyond its current pace of omni-channel makeover", "520": "Amazon walks from NYC – didn’t officials suck up enough?", "521": "Let’s focus on being people in a business", "522": "Purported server sabotage illustrates potential risks of Chinese supply chains", "523": "In the front seat to 2020 – understanding what’s driving digital transformation", "524": "Do you know your ETA from your elbow?", "525": "Elastic Path took a different commerce road, and it’s working", "526": "U.S. Justice Department to sue California on net neutrality law", "527": "Japan and the EU create the world’s largest safe data flow zone – and not a Privacy Shield in sight!", "528": "Unit4 snags Intuo for modern talent enablement", "529": "Cognita connects its people across schools in three continents", "530": "Hudson’s Bay Company makes a bold omni-channel gambit with European merger", "531": "Mark Zuckerberg gets privacy religion, but is it a case of ‘born again’ or cynical pragmatism?", "532": "UK’s Digital Services Tax plans called into question at home and in the US", "533": "Inside the surprising Workplace by Facebook – what I learned from Workplace product leaders", "534": "The informal NRF demo awards – a countdown of retail tech in action", "535": "Brexit chaos – the business verdict from SAP Business ByDesign customers", "536": "Do mention the B-word – an exit from Brexit silence from business leaders", "537": "Did Chinese government hackers really plant spy chips in Apple and Amazon servers?", "538": "AIOps – hype aside, ML-infused analytics tackles problems in heterogeneous systems and applications", "539": "For most CFOs, a new finance system is as welcome as a root canal", "540": "Brian Sommer’s Month in Brief – January 2019", "541": "How SuccessFactors supports HR’s pivotal role as Teva navigates change", "542": "Huawei eyes targeting cloud services to help exploit 5G in business applications", "543": "Digital media disruptions 23 – audience metrics that matter, and the content brevity debate", "544": "Why enterprise IT is moving to the cloud – and when it’s not", "545": "Nordstrom gets digital dividend, as JC Penney bombs out – a tale of two retail omni-channel pushes", "546": "Infor thru the stages- what’s the next phase?", "547": "Done Right part deux – a conversation with Alex Shootman, CEO Workfront", "548": "How to engineer a start-up mindset – by thinking people first", "549": "SAP TechEd day one, burning questions edition – beaming up serverless ERP and the ABAP PaaS", "550": "Why Sportable Scoreboards moved to cloud ERP, and what they’ve learned about change – Oracle MBX ’19", "551": "AI and ethics – challenging questions from the UK with global applicability", "552": "France says it isn’t on a digital tax “crusade” against the US. Trump twitter storm incoming?", "553": "Is HowDoo the future of social media platforms? An inside look at HowDoo’s ambitious Facebook alternative", "554": "News analysis – Plex bears down on the industrial IoT data problem with its DATTUS acquisition", "555": "Does Brexit mean permanent dislocation of the low paid workforce?", "556": "Why every employee deserves to feel like they belong", "557": "Job boards and recruiting solution gaps – Part One", "558": "Stopping your autonomous cloud get a head-cold with Dynatrace", "559": "The Year That Was – the Madeline version", "560": "Cloverpop shines light on how to improve enterprise decision making", "561": "C’mon now – the customer isn’t in control. On Google, Amazon and the algorithmic plight of the super-user", "562": "10 thought-provoking social, tech and business predictions for 2019", "563": "Why HireVue combines video interviews with game-based assessment", "564": "Sainsbury’s drills down on digital while waiting for regulator decision on Asda takeover", "565": "France blinks, but there’s still no sign of an EU Digital Services Tax deal in sight", "566": "Lyft wants me in their community but they won’t let me ride", "567": "MongoDB evolution continues with launch of mobile, visualisation tools and general availability of Stitch", "568": "Brian Sommer’s Month in Brief – March 2019", "569": "Organizational architecture and agility – the Workday perspective", "570": "UK gives Facebook a rap on the knuckles over data privacy, but bigger fines may lie ahead", "571": "Paf takes a bet on Sumo Logic for cloud systems performance", "572": "Splunk wants partners to exploit tech trickle down", "573": "Delivering digital growth – how Target’s store-as-hub strategy paid off", "574": "Want to build more revenue in manufacturing? Real-time monitoring is the key", "575": "Jane’s Due Process deploys text hotline in its work on reproductive rights", "576": "Brussels Airlines gets new recruits off to a flying start with Talmundo", "577": "Ralph Lauren combines ‘drop’ and digital to catch the streetwear Gen Z buyer", "578": "Workday CEO Bhusri is  keeping calm and carrying on in the ‘new normal’", "579": "Brian Sommer’s  month in brief – November", "580": "When it comes to data center users, Intel recognises `what do you want?’ rather than `look what I’ve got’", "581": "Tableau’s CPO on the spot – how can we extol the power of data in such a hyper-partisan world?", "582": "HR Tech vendors disappoint on the topics that matter to buyers", "583": "Taking price-cutting too far – how Hudson’s Bay Company’s bargains undermined omni-channel transformation progress", "584": "How MercadoLibre built a learning culture to keep up with its growth – an SAP SuccessFactors story", "585": "Optymyze ABM program focused on high-intent audiences", "586": "GDPR – forcing organizations to wake up to data protection basics", "587": "Exclusive – Condé Nast on the pursuit of customer experience at web scale, with DataStax Enterprise", "588": "Fixing the human and technology disconnects in siloed monoliths", "589": "Misrepresentation and technical nuances – Facebook’s answers to legislators questions under fire", "590": "Real-time for the win – how Donnelly Custom Manufacturing excels at short-run manufacturing with IQMS", "591": "Fixing the recruiting process – Part 2, the recruiter bias problem", "592": "Meltwater pivots to let data scientists loose on the world’s biggest business dataset", "593": "Government opens up for ServiceNow as customer growth continues to swell", "594": "The store as digital gateway – A&F prototypes an omni-channel shopping experience", "595": "Up from the ashes – California moves to restore tough net neutrality rules", "596": "Build better mobile experiences – Ogury on mobile journey management as data privacy heats up", "597": "Can vendors like Workday, Salesforce ever get enough AI?", "598": "Aera CEO Laluyaux – AI, self-driving and why it’s time to stop being excited by old enterprise software ‘innovation’", "599": "Finding the workforce of the future – a conversation with Leighanne Levensaler, Workday", "600": "Dreamforce 2018 – rocking fan engagement with Metallica", "601": "Workday People Analytics – an early look at ML augmented analytics", "602": "The Telegraph moves its cloud ‘crown jewels’ to Google", "603": "Huawei Connect 2018 – the war for AI talent", "604": "Stephen Kelly ousted as Sage CEO after dismal results and faltering transformation", "605": "‘GDPR-US’ is needed, says Apple’s Tim Cook as he blasts “data industrial complex”", "606": "Finance organizations are biggest digital transformation fans – three exemplars", "607": "Meaningful personalization – are you there yet? A look inside Sailthru’s Personalization Index", "608": "Finger-lickin’ good digital transformation as KFC aims to be in the RED", "609": "The month in brief – reading material, briefings, roadshows", "610": "ASC 606 is here and it can transform your business for the better", "611": "Triumph Motorcycles revs up digital transformation with Infor roll-out", "612": "An International Women’s Day question – where are the tech women who look like me?", "613": "Dreamforce 2018 – Keith Block on integration, innovation and life as a co-CEO", "614": "Putting the customer at the heart of marketing – Salesforce CMO Stephanie Buscemi on how it’s done", "615": "Oracle OpenWorld 2018 – CERN turns to Oracle cloud to manage Large Hadron Collider growth", "616": "Sage Intacct Advantage 2018 – customers speak to the results of financial transformation", "617": "You want AI with that? McDonald’s latest tech gambit gets highly personal", "618": "OECD boss – a first draft at global digital services tax ready for June?", "619": "Getting closer to guidelines on ethical AI", "620": "SuccessConnect 2018 – inside Ernst & Young’s drive for a purposeful workplace", "621": "NetSuite’s growth agenda – and its plans for software expansion", "622": "Enterprise hits and misses – Marriott stinks, Quora is questionable, and the omni-channel is elusive", "623": "MongoDB CEO – ‘We rarely see other NoSQL vendors in deals anymore, they’re less relevant’", "624": "Jamie Oliver’s recipe for social media success is always great content", "625": "The Black Friday gotchas you don’t know about yet", "626": "Infor on retail at NRF ’19 – C-level buy-in is fueling retail cloud adoption, and storefronts still count", "627": "Omni-channel still sparkles at Tiffany as global IT platform rolls out", "628": "Fancy dismembering your data center and throwing it to the four winds?", "629": "Enterprise hits and misses – summer retail blowout, IBM Watson healthcare media showdown", "630": "Intel – putting substance behind its strategy slideware", "631": "Dreamforce 2018 – testing your liberal credentials", "632": "Cloud-agnostic container platforms – it’s all to play for", "633": "Report – Workers fear that they’re being replaced by robots and are worried that their employers aren’t helping them to adapt", "634": "Cobots – how to live with them, work with them and love them", "635": "The Year That Was – the Derek version", "636": "Journeys in big data and AI across the transport networks of London & Paris", "637": "M&S pays Ocado £750 million for an online grocery ‘ready meal’", "638": "IQMS Pinnacle 2018 – How Eldon James is turning their integrated manufacturing vision into reality", "639": "How Grubhub delivers on the promise of digital", "640": "M&S and Ocado – placing an order for a digital delivery dream team?", "641": "Luminar sees the future of autonomous vehicles in 3-D", "642": "Reflections on HR Tech Las Vegas 2018", "643": "Brian Sommer’s Month In Brief – December 2018", "644": "Oracle OpenWorld 2018 – Birmingham City University replaces back office with Oracle Cloud in under 300 days", "645": "Weekend musing – a simple Kill Switch solution to the mess that is Facebook", "646": "NRF 2019 – Facial recognition brings personalization to a head, and I put my face to the test", "647": "Signs of progress at H&M as online retail platform rollout is completed?", "648": "Welcome Neptune Software – the latest addition to the diginomica family", "649": "How Plex disrupted the analyst day – via a shop floor tour with customer Coastal Automotive", "650": "Culture challenges on the digital agenda for 2019", "651": "Why Rimini Street is reinventing TPM for the world of SaaS", "652": "Workday’s Bhusri on indirect access, AWS, happy customers and next gen finance", "653": "Two decades of online doesn’t guarantee the necessary omni-channel balance for Nordstrom", "654": "Enterprise hits and misses – Black Friday looms, SAP splurges on Qualtrics as CX heats up", "655": "How Medivis plans to use augmented reality and AI to change medicine", "656": "How finance can drive change and deliver value for all", "657": "ServiceMax CEO eyes the opportunity of ‘Uberized’ labour markets for field service agents", "658": "The future marketers want is less technical, but requires the right tech", "659": "New Relic acquires CoScale to double down on monitoring Kubernetes", "660": "A Chinese e-commerce warning to Washington – a trade war will hurt you more than us", "661": "How Slack enables frictionless teamwork at digital bank Monzo", "662": "Strategic financial transformation begins with people", "663": "Local marketing tactics are necessary – but the data says they’re not happening", "664": "How tech thinking, not tech alone, saved Levi’s", "665": "Huawei Connect 2018 – why the intelligent world means AI chips with everything", "666": "GDPR – practical lessons from the user front line", "667": "Ben Sasse wants you to know that he is really worried about Deepfakes", "668": "Qualtrics acquired – SAP’s high priced bid to solve customer experience", "669": "VMware’s vision – your multi-cloud substrate for enterprise applications", "670": "Dreamforce 2018 – How Trailhead puts Salesforce admins at the heart of its future", "671": "Enterprise hits and misses – pseudo AI gets exposed, and women in tech rock on", "672": "Enterprise hits and misses – tech leaders weigh in on AI and IoT, but can AI save us from ourselves?", "673": "Tibco Labs and the Blockchain Experiment – cue scary music!", "674": "Open source is free – yeah, right! ", "675": "Computer Economics finds enterprise DevOps is more aspirational than reality", "676": "Understanding Intel’s multipath data-centric high wire act", "677": "SAP restructures as it sets long term ambitions while meeting Q4 FY2018 expectations", "678": "UK government urged to regulate and fine the likes of Facebook over fake news", "679": "Engagement, functions, resources – a connected digital enterprise architecture", "680": "SAP Customer Experience CTO explains why YaaS was retired in favour of Cloud Platform Extension Factory", "681": "Dreamforce 2018 – Benioff takes no prisoners in activist call to arms", "682": "Forget cloud vs edge. It’s the connections, stupid", "683": "Lawnmowers and analytics – Zuora’s broad church of Subscription Economy companies", "684": "Can AI be bounded by an ethical framework?", "685": "Brian Sommer’s The Month in Brief – August, 2018", "686": "AB InBev brews up greater insight into changing customer trends", "687": "How to avoid ERP lock-in and seize the service imperative", "688": "MuleSoft CTO on the quest to open up metadata at Salesforce", "689": "CIOs want to run IT as a business and that suits ServiceNow CEO John Donahoe nicely", "690": "Global-bound Alibaba partners with SAP on pushing HANA further into the cloud", "691": "Digital media disruptions 22 – assessing B2B paywalls, Facebook’s algo, and the changing rules of SEO", "692": "PwC says its Digital Accelerators will future-proof the workplace – here’s why", "693": "FocusConnect 2018 – JDA Software’s ‘work in progress’", "694": "Oracle Cloud Chief explains why autonomous features will further blur enterprise lines", "695": "Alibaba’s AI drives towards the smart road ahead", "696": "Coffee to your door as Starbucks makes delivery its latest digital gambit", "697": "Web founder Berners-Lee rallies Solid rebellion against digital empires", "698": "Flat hierarchies – progressive organizational thinking or digital’s ‘flat earth’ theory?", "699": "Shoebacca at the Acumatica Summit – competing against Amazon means uniting the front office and warehouse", "700": "Insights on cloud growth from AWS and Microsoft latest earnings", "701": "L’Oréal CEO – size matters in pursuit of ‘beauty tech’ leadership", "702": "Salesforce adds AI so customer service can be more human", "703": "Retrofitting AI – key adoption issues in the enterprise 2019-2020", "704": "Can AI help recruiters win the talent game? A practical view from Anixter’s Matt Mackin", "705": "The high price of privacy – Facebook sees $150 billion wiped from its market cap", "706": "New Relic takes on notifications overload problem with SignifAI buy", "707": "As HSBC, NatWest and RBS turn back small business accounts, challenger banks pick up", "708": "SAP Nation 3.0 – Manifest Destiny, a review and conversation", "709": "Who are we kidding? Silicon Valley was built on the business of war", "710": "2019 – when the content platform wars get real as Disney readies its Netflix-killer app", "711": "Regulation or hesitation – how to manage the internet? Where we go next…", "712": "Oracle OpenWorld 2018 – Gartner, who? CEO Mark Hurd gives his technology predictions for 2025", "713": "Kohl’s benefits from Amazon partnership, but remains curiously cautious", "714": "Who needs lawyers?  DoNotPay lets you ‘sue anyone’ free via a chatbot", "715": "Technology won’t solve America’s mass school shooting dilemma", "716": "CIO ‘partnership’ drives strong year-end for ServiceNow", "717": "Atos lays out $3.4 billion to beef up digital cred via Syntel acquisition", "718": "Wendy’s looks to $25 million digital transformation as it enters its second half century", "719": "Powerpoint-drenched events are legacy. Why unconferences and white board sessions are the way forward", "720": "ThoughtSpot users advice on analytics – ‘Jump in, make mistakes, keep talking’", "721": "Macdonald Hotels gives staff the five-star treatment with Oracle HCM and Taleo", "722": "House of Fraser needs to do more than just “hammer” Amazon in a Shopper First Retailing world", "723": "SAP TechEd 2018 – focusing on cloud complexity, ABAP, APIs and events", "724": "FutureStack18 London – focusing on customer success", "725": "Enterprise Hits and Misses (truncated) – the Jon’s on vacation edition", "726": "HPE and HP Inc – when breaking up works out for the best", "727": "Europe to Trump – clean up your Privacy Shield act by September or we’ll do…what exactly?", "728": "International Women’s Day – why we need to reach girls before negative perceptions of a tech career take root", "729": "Understanding the Slack and Atlassian partnership that sees HipChat and Stride shuttered", "730": "Moody’s stirs the pot on UK Digital Services Tax plan as EU ministers meet to bake up a Euro-fudge", "731": "Inforum 2018 exclusive – the state of Infor’s SaaSy reinvention with CFO Kevin Samuelson", "732": "Is Process Intelligence (Mining) a distinct discipline from analytics?", "733": "Oracle OpenWorld 2018 – Be selfish, be a role model and take affirmative action: How to be an inclusive leader", "734": "The search for trust – joining some dots", "735": "The only way is ethics as Salesforce opens Office of Ethical and Humane Use of Technology", "736": "Building high performance surfboards to catch the global wave – Firewire’s cloud ERP journey with Acumatica", "737": "How to make the IoT work for everyone – the view from Davos", "738": "SuiteWorld19 – build diverse teams and show the benefits for your organization", "739": "Accenture and the art of going post-digital", "740": "Built founder on constructing a disruptive start-up on NetSuite foundations", "741": "The month in review", "742": "Driverless car tech – it’s a long road ahead, according to Ford Motor and GM", "743": "Assessing another new normal – complex multi-cloud environments", "744": "B2B Buyers are changing; we are all publishers now – answering the top audience questions", "745": "Q3 Shopping Index – raising digital retail hopes for a Happy Holidays?", "746": "Dreamforce 2018 – data, data, data, but what about the process?", "747": "Oracle OpenWorld 2018 – The intelligent apps equation", "748": "Digital initiatives earn the CIO a top seat at the strategic planning table", "749": "Lands End – digital innovator once more, but not chasing ‘pretty’ stores?", "750": "The challenge of closing the equal pay gap", "751": "ServiceMax acquires Zinc – blending front-end collaboration with service execution", "752": "Ocado CEO – here comes the next generation of robots in retail", "753": "CHRO study highlights the changing role of aspiring HR leaders in the digital era", "754": "Job boards and recruiting solution gaps – Part Two", "755": "5 compelling reasons we’ll use email for decades yet – SendGrid CEO", "756": "Costco’s dilemma – e-commerce is the future, but the business model is about the warehouses", "757": "How soon will Salesforce Service Cloud outgrow Sales Cloud?", "758": "Ultimately Ultimate goes private – what next?", "759": "Experian’s Global CIO – how we created a standardised platform for information consistency", "760": "Sunday Salute – IBM fixes a GDPR SNAFU, delivers problem resolution masterclass", "761": "Where next for Atlassian’s HipChat and Stride customers?", "762": "Digital delivers for the restaurant sector – three use case takeaways on the menu", "763": "HfS FORA UK – the robots are here, get over it and move on. Next up?", "764": "2019 productivity gut check – don’t let metrics squeeze your value", "765": "More threats and deadlines from Brussels to Washington, but Privacy Shield’s cracks are papered over for another year", "766": "The illustrated 2018 customer service fail awards – exclusive personal edition", "767": "Go wild, indulge or kick back by the pool ─ the bracelet that’s the key to holiday cool", "768": "ThoughtSpot Beyond 2018 – democratising analytics by talking to it", "769": "Enterprise hits and misses – job boards face critique, and a powerful AI tool gets put on probation", "770": "Pre-Brexit Britain decides now’s the right time to pick a digital tax fight with the US tech sector", "771": "Enterprise hits and misses – Autonomous AI is scary, Slack buys (parts of) Atlassian", "772": "Monese customers ‘bank without boundaries’ thanks to Unbabel translations", "773": "DSAG member investment plans – AI bubbles up, Big Data and IoT lead the way", "774": "Oracle OpenWorld 2018 – State of Wisconsin shares lessons learned on rolling out Oracle Exadata and how to reduce license costs", "775": "Why the 2020 US election campaign will be brutal for Big Tech", "776": "Content intelligence – do you know how well your content is performing?", "777": "Dreamforce 2018 – Thomson Reuters’ challenging journey from product-first to customer-first", "778": "Sitecore takes on Adobe with latest release + major DAM acquisition", "779": "Zoholics 2019 show review – assessing Zoho’s big market play and learning from Zoho Analytics customers", "780": "Dreamforce 2018 – there’s more to Salesforce Analytics than Einstein", "781": "Financial Wellness – a skeptical prognosis on an HR solution du jour", "782": "What do I do with my Apple Watch? I tell the time, of course!", "783": "How Nasdaq uses Zoom to liberate their meeting rooms and change their collaboration game", "784": "The US is fully-compliant with Privacy Shield requirements and there’s no more to be said…apparently.", "785": "Now with AI, Guru brings the knowledgebase to service agents", "786": "Project JEDI – the ‘Big Blue’ Empire strikes back", "787": "M&S CEO – we need more tech, but we still don’t need to do online grocery", "788": "The assassination of Versace as Michael Kors pledges e-commerce push on luxury brand?", "789": "Lands End goes over the cliff as omni-channel progress remains sluggish", "790": "Oracle introduces autonomous transaction processing database – pounds on AWS", "791": "Oracle OpenWorld 2018 – East Midlands adopts Oracle Cloud to drive better ways of working in local gov", "792": "Done Right – Alex Shootman’s perspective on modern workforce management", "793": "Oracle OpenWorld 2018 – iGeolise maps out its experience as part of Oracle accelerator programme", "794": "Huawei Connect 2018 – taking stock of a range new offerings", "795": "Pre-re:Invent hype illustrates the growing importance of the AWS ecosystem", "796": "Cloud ERP is a non-starter without the right partners – inside FinancialForce’s partner strategy", "797": "Isn’t it time to lose the e-commerce attitude at the high-end of retail?", "798": "Dreamforce 2018 – a look at how Cary, North Carolina, is turning itself into a smart city", "799": "Retail’s Black Thursday – digital laggards Debenhams and M&S spread New Year’s gloom", "800": "Peek-a-boo!  CAST helps you look inside software to find what might kill your business", "801": "Taming the multi-cloud monster – organic adoption vs. bureaucratic control", "802": "And the winner is…some social referral and engagement numbers for you to decode", "803": "Enterprise content hub Box sees value-add in workflow", "804": "How Nationwide Insurance uses Tableau to drive its data-driven ambitions", "805": "Regulate me! Does Mark Zuckerberg really want government to stage an intervention?", "806": "Oracle OpenWorld 2018 – Boeing and the Mormons praise PeopleSoft navigation and mobile improvements", "807": "Trump steals the Brexit headlines, but the UK’s digital plans beg many questions for global trade", "808": "Is Nano Vision’s drive for better healthcare research using AI and blockchain a field of dreams?", "809": "Salesforce’s Chief Equality Officer asks – “Which side of history do you want to be on?”", "810": "Pizza Hut looks to digital delivery to shake off legacy dine-in brand", "811": "Autonomous AI is the end of the world as we know it. Do you feel good about that?", "812": "The Data Warehouse is dead – long live the Data Warehouse", "813": "Enterprise hits and misses – peeling back the AI hype, and handing out this year’s cheeky blogger awards", "814": "Walmart delivers e-commerce cheer as Indian market push begins", "815": "Lands End on firmer ground, but omni-channel challenges remain tough as exit from Sears continues", "816": "SAP TechEd 2018 – PostNL pushes the cloud boundaries, API development and integration", "817": "Enterprise hits and misses – AI gets field lessons, Huawei gets scrutiny and flat hierarchies get a reality check", "818": "Analytics for all – not just Rockefellers, rock stars and rocket scientists", "819": "Bandwidth Alliance targets an insidious form of cloud lock-in", "820": "Why Caterpillar wants to turn into a digital butterfly", "821": "Database popularity is skyrocketing – and this is why you should care!", "822": "Macy’s CEO – we’re ready for an omni-channel Holiday season", "823": "Outsourcing is dead……long live outsourcing", "824": "Booz Allen Hamilton’s journey to the future", "825": "New Relic’s Lew Cirne and the art of knowing your place", "826": "Manchester United shoots and scores on the field of digital engagement", "827": "SAP UK & Ireland User Group report continuing issues with indirect access and SAP technology adoption", "828": "Why social inclusion requires a collective approach to spread the benefits of digital transformation", "829": "Walmart hits road bumps in UK and India, but e-commerce soars in the US", "830": "Are peer review sites impacting the large enterprise buyer? TrustRadius says yes", "831": "While retail consultants focus on technology are they forgetting the basics?", "832": "How Tilray is pushing to scale with the cannabis market – and Acumatica SaaS ERP", "833": "Landing and expanding – Zuora CEO Tien Tzuo on conquering industry sectors", "834": "Coupa platform reaches out to deliver enterprise spend as a service", "835": "SundaySky wants you to create truly personalized videos", "836": "Voici le Euro Fudge (encore!) – France’s demands for US-aimed ‘turnover tax’ crash and burn in Brussels", "837": "Australia’s ticketing giant Ticketek goes all in with MongoDB – ‘It’s the only database up to the task’", "838": "Jobvite on finance transformation, cloud financials, and the push for a strategic finance team", "839": "Workflow is the big new talking point at the water cooler", "840": "Fixing the recruiting process mess – Part 3, getting from zero to one", "841": "HMV falls, Sears gets a glimmer of hope – retail 2019 off to a busy start", "842": "Tech apprenticeship schemes – should they be hired or fired?", "843": "Welcome to Zoho", "844": "Do we understand the importance of ethical technology?", "845": "Is Accenture’s SynOps automation solution a killer app or a job killer?", "846": "Zoho One adds AI, search, analytics, in pitch to midmarket", "847": "Iceland’s digital marketing exemplar is no festive monkey business", "848": "Inforum 2018 – CEO Charles Phillips on Coleman AI and the problem of enterprise productivity", "849": "Exclusive – SAP on the future of SAP payroll, including cloud payroll", "850": "Can data make the world a better place? The Data Science for Social Impact Collaborative thinks so", "851": "Macy’s CEO pitches the omni-channel retail long game", "852": "Modeling humans for personalized medicine – a prescription for trouble?", "853": "Be The Match finds quality partner in SQS", "854": "Oracle OpenWorld 2018 – Wells Fargo and Halliburton reap the benefits of consolidating on Oracle Exadata", "855": "UK legislator calls for tax on US tech firms to fund the BBC and state-owned social media platform", "856": "The robots are coming to serve you – just not in the way you think", "857": "The impact of personalization – real or imagined? A critique of Sailthru 2018 Retail Personalization Index", "858": "An object lesson in addressing Rumsfeld’s Third Question – the real reason for analytics", "859": "AT&T unveils edge-to-edge blockchain solutions for IoT – is it a winner?", "860": "Oracle OpenWorld 2018 – Lambeth Council moves to the cloud after painful experience with shared services", "861": "The SaaS memo most ERP vendors missed", "862": "Is content experience the evolution of content marketing?", "863": "Energy giant Engie gets more agile with Boomi integration", "864": "Regulation or hesitation – how to manage the internet? The story so far…", "865": "The tech project survival guide", "866": "Bolstering digital economy competitiveness will take more than gesture politics", "867": "Rimini Street opens up a new front with first public incursion into Salesforce territory", "868": "Dunkin’ ups the digital sprinkles by taking more control of its mobile destiny", "869": "The big question – what if automation kills more jobs than it creates?", "870": "We need to talk about organizational change management", "871": "Is digital transformation sticking to the wall, or losing its meaning? Debating digital data with Brian Solis", "872": "Know your desired outcomes – IoT and the consumable future", "873": "Enterprise hits and misses – the robotic future of work is messy, and Facebook’s brand erosion is lucrative", "874": "Döhler moves foodstuffs at webspeed with SAP – how it’s done", "875": "Equiniti – exposing the unknown unknowns that cause customers problems", "876": "Battling bias – cleansing corporate decision-making in an age of diversity", "877": "UK legislators to Facebook – you’re obstructive, neglect your responsibilities and shouldn’t mark your own homework!", "878": "SAP Business ByDesign – the red headed bastard child that refuses to die", "879": "SAP and Qualtrics – how might this work and what are the barriers?", "880": "Fixing up Lowe’s is a renovation project that needs its own digital improvement", "881": "Application development to a fixed price, fast – sounds like wizardry", "882": "How a bank, a travel agency and a sales team built call centers on Twilio", "883": "Digital transformation is for life, not just for go-live", "884": "Digital With Impact – Brian Sommer’s opus for the 21st century enterprise", "885": "Six customer-led field service learnings I picked up", "886": "AWS, HPE, Red Hat on 8 secrets of customer success with your SaaS vendor", "887": "How to unlock IoT as an engine of human potential", "888": "Atlassian reimagines Jira to herd cats, a.k.a. developer teams", "889": "DSAG and SAP on more or less the same page? Tell me it ain’t so.", "890": "Is it time to is pull the plug on hate speech online? Can AI help?", "891": "Alibaba Cloud expands in Europe as it aims to change the rules", "892": "BritBox isn’t a Netflix killer; that’s Mickey Mouse’s job!", "893": "ServiceMax CEO gives the lowdown on GE Digital selling majority stake to Silver Lake", "894": "Oracle MCX 2019 – Blue Cross Blue Shield of Michigan shares why moving to the cloud is just one part of business transformation", "895": "Do video marketing right – the pros and cons of YouTube and more", "896": "Admit that it’s not magic", "897": "‘Where America Shops’ isn’t Sears – US retail’s biggest omni-channel casualty to date", "898": "ECM-as-a-Platform – building a modular, extensible approach to content management", "899": "Europe’s Privacy Shield threat deadline has passed and no-one in Washington has blinked", "900": "How Kiva uses data analytics to lend a hand (and money) to refugees", "901": "Dreamforce 2018 – how ABB went from ‘inside-out’ to ‘outside-in’", "902": "Senior management’s security hypocrisy on show", "903": "How Lightstreams is putting the privacy back into blockchain", "904": "Zoom CEO on the new wave of collaboration – customers want best-of-breed, with no weak links", "905": "Enterprise hits and misses – Ultimate Software goes private, AI adoption gets scrutiny, and leadership gets Scrummy", "906": "Ethical concerns around healthcare data exploitation demand legislative action", "907": "Harrods and the China syndrome sell luxury retail e-commerce credentials for Farfetch", "908": "Why Domino’s Pizza keeps on top of what the competition is up to in digital", "909": "Infor 3.0 is all about people and the future of work – an interview with CEO Charles Phillips", "910": "Oracle OpenWorld 2018 – making the cloud friendly for enterprises that distrust cloud", "911": "VMWare NSX – network virtualization as VMware’s secret weapon?", "912": "Cloud Next 18 – Google moves up the AI stack into enterprise apps", "913": "Bank of America CEO – digital banking isn’t all about the millennials", "914": "How artificial intelligence is changing web content management", "915": "Dreamforce 2018 – ditch happy hour and play hardball", "916": "Harambee recruits Google Cloud in fight to tackle youth unemployment", "917": "The B-word(s) – Block, business and Brexit", "918": "Cloud Next 18 – HSBC to run business banking on Kubernetes in Google Cloud", "919": "Cloud repatriation – the latest push back to public cloud is analyst vaporware", "920": "GPS uses AppDynamics to get its tech, business and customer ducks in a row", "921": "Enterprise hits and misses – fighting through digital nightmares; IT does matter after all", "922": "Calories and community, weight and wellness – the digital reinvention of WeightWatchers", "923": "Thinking about that elusive target – content-driven experiences", "924": "It’s a mad, mad, mad IoT world – protecting America’s power grid from common household appliances", "925": "ASOS profit collapse highlights the importance of animal print skirts as well as working tech", "926": "SAP TechEd 2018 – How Kaeser Kompressoren is selling compressed air as a service with the help of SAP Data Hub", "927": "McKesson on cloud, identity and the digital transformation of healthcare", "928": "Google Cloud Platform sets the scene to remove barriers between IT and business", "929": "Enterprise hits and misses – IoT security gets blockchained, and open source gets blogchained", "930": "Oracle OpenWorld 2018 – City of San Jose reimagines the citizen experience with Oracle", "931": "Is Amazon’s purchase of PillPack a prescription for disruption in the pharmacy industry?", "932": "Is Target the easiest place to shop in the US as CEO boasts he was right about omni-channel vision?", "933": "The Year That Was – the Phil version", "934": "Jet-powering Walmart to go on the offensive – e-commerce chief Marc Lore has battleplans", "935": "FinancialForce Community Live in review – talking servitization, proscons of Salesforce platform and more", "936": "Four SMB views on why you need a fast-moving business system", "937": "How to build the finance function of the future", "938": "Codeinks – a use case in providing the best insights to customers", "939": "A tale of two burgers – digital transformation at Wendy’s and Red Robin Gourmet Burgers", "940": "AI chatbots are at the heart of a great experience for the next generation", "941": "Tibco helps Cyberlogitec contain the ‘where’s my container?’ problem", "942": "Smart cities – focus on people, not tech, says policy conference", "943": "What’s new at diginomica and fresh angst among independent industry analysts", "944": "Report analysis – AI and automation raises the stakes on IT security skills", "945": "CloudBees aims to ease the pain of the ‘Innovation Tax’", "946": "Oracle OpenWorld 2018 – Oracle customers discuss bringing the cloud inside their own data centres", "947": "IT’s new role – the business catalyst", "948": "G20 says ‘something must be done’ on tax in the digital economy…but not just yet, eh?", "949": "How Istio is helping Auto Trader on its way to the Google cloud", "950": "Future Enterprise – our foray into the world of podcasting", "951": "Why voice is the next frontier", "952": "VMware clambers on the container bandwagon", "953": "Cloud ERP success requires more than a go-live – the debate continues", "954": "Shaping ‘GDPR-US’ – it’s a long way from Davos to Washington in more ways than one", "955": "Enterprise hits and misses – retail gets a once-over, and Facebook asks for a privacy do-over", "956": "Twilio’s $2 billion for SendGrid says that email’s not dead", "957": "Salesforce aims to smarten up customer experience with Service Cloud Einstein", "958": "Cyber-security and internal data leakage – make it ‘our’ fault, not ‘their’ fault", "959": "Midmarket customers praise Zoho ease of use and extensibility", "960": "MicroStrategy 2019 – Hyperintelligence plays to the emerging voice market", "961": "Life after Toys R’ Us means upping omni-channel retail thinking for Hasbro", "962": "National Grid makes savings by giving engineers control of their data using Tableau", "963": "Forget celebrity influencers – reach micro-influencers who impact your brand", "964": "SAP’s Open Data Initiative aims to appease buyers hungry for open source and machine learning", "965": "Why Prada wears digital – the devil’s in the detail", "966": "Why Majestic Wine raises a glass to AWS for its cloud platform needs", "967": "Dreamforce 2018 – Salesforce Customer 360, at last, a single view of the truth?", "968": "How Anixter is integrating AI into recruiting – with AllyO", "969": "Willerby gives holiday homes a more personal touch with Infor", "970": "Europe deals the open internet a blow as controversial copyright rules take a step closer to law", "971": "Zuckerberg ‘sends his cat’ as 9 governments slam Facebook CEO for not talking to 447 million people", "972": "Enterprise hits and misses – Dreamforce dreams, Infor informs, and Microsoft ignites", "973": "Barclays CRM team designs banking experiences at scale with Salesforce", "974": "Book review: Life After Google – The Fall of Big Data and the Rise of the Blockchain Economy", "975": "Larry Ellison says no-one “normal” would move to Amazon as Oracle keeps Wall Street happy with Q2 numbers", "976": "Guinness World Records breaks cloud barrier with Ensono", "977": "It’s 2018 so why isn’t my ERP vendor multi-tenant?", "978": "2018  – the year of cloud competency as an enterprise IT ‘must have’", "979": "Where to for ThoughtSpot under new leadership?", "980": "How World Learning seized the day by building apps on the Sage Intacct platform", "981": "‘Streaming data, but screaming staff!’ – Ciena turns to Graph to solve customer issues", "982": "Gender, GDPR and tooling up for the cyber-wars – thought leadership from Barbara Endicott-Popovsky", "983": "A conversation with Google Cloud CEO Thomas Kurian – solving the enterprise multi-cloud problem", "984": "Break-even in sight for Box as enterprise deals increase in size and number", "985": "Wipro sells off Appirio HCM practices for $110m to IPO-bound Alight", "986": "The state of ABM and the need for personalized content", "987": "More thoughts re: Ultimate Software – is a lot of debt now a good thing?", "988": "Salesforce on retail – mobile shopping crosses the Rubicon, and AI pushes beyond tech talk", "989": "Why smart software to gauge employee satisfaction is seen as a vital component in Madison Reed’s corporate mission", "990": "SAP Q3 FY2018  – cloud momentum continues, ups guidance", "991": "Twitter’s pursuit of “health” in a Fake News world would bring a tear to a glass eye", "992": "The Year That Was – the Martin version", "993": "Ready for Everything-as-a-Service? 5 things you need to know", "994": "Could you be “vicariously liable” for a data breach? Ask Morrisons – and be afraid!", "995": "Atlassian mobilises to tackle incident-response needs of IT operations", "996": "Workato adds out-of-the-box automation of customer and employee journeys", "997": "Are we prepared to solve for algorithmic bias?", "998": "2018 – when vendors built the foundations for AI while enterprises looked for useful applications", "999": "Sen. Mark Warner’s 15 ‘common sense’ rules for Social Media platforms", "1000": "Is WordPress becoming the SAP of CMS’s?", "1001": "How 5G will impact the customer experience"}